USE se; 
INSERT INTO kjoretoy(kjoretoy_navn, kjoretoy_id) VALUES
("Tog", 1),
("Buss", 2);

INSERT INTO Rute (rute_id, rute_navn, kjoretoy_id) VALUES
(1,'tog1', 1),
(2,'tog2', 1),
(3,'buss1', 2),
(4,'buss2', 2),
(5,'buss3', 2),
(6,'buss4', 2),
(7,'buss5', 2),
(8,'buss6', 2),
(9,'buss7', 2),
(10,'buss8', 2),
(11,'buss9', 2),
(12,'buss10', 2);

INSERT INTO stoppested (stoppested_id, sted_navn) VALUES
(1,'Moss'),
(2,'Halden'),
(3,'Sarpsborg'),
(4,'Fredrikstad'),
(5,'Rakkestad'),
(6,'Kornsjø'),
(7,'Rygge'),
(8,'Remmen'),
(9,'Greåker'),
(10,'Østfoldhallen'),
(11,'Borgenhaugen'),
(12,'Rudsskogen'),
(13,'Festningen'),
(14,'Prestebakke'),
(15,'Råde'),
(16,'Svinesundparken'),
(17,'Saltnes'),
(18,'Ise'),
(19,'Solli'),
(20,'Viksletta'),
(21,'Gressvik'),
(22,'Kalnes'),
(23,'Skjeberg'),
(24,'Sandbakken'),
(25,'Begby'),
(26,'Skjærviken');

INSERT INTO stoppested_has_rute (rute_id, stoppested_id, rekkefolge) VALUES
-- Tog 1
(1,1,1),
(1,7,2),
(1,15,3),
(1,4,4),
(1,3,5),
(1,9,6),
(1,23,7),
(1,2,8),

-- Tog 2
(2,2,1),
(2,3,2),
(2,4,3),
(2,15,4),
(2,7,5),
(2,1,6),

-- Buss 1
(3,1,1),
(3,7,2),
(3,15,3),
(3,19,4),
(3,22,5),
(3,3,6),
(3,11,7),
(3,24,8),
(3,23,9),
(3,20,10),
(3,16,11),
(3,8,12),
(3,2,13),

-- Buss 2
(4,2,1),
(4,8,2),
(4,16,3),
(4,20,4),
(4,23,5),
(4,24,6),
(4,3,7),
(4,22,8),
(4,19,9),
(4,15,10),
(4,7,11),
(4,1,12),

-- Buss 3
(5,1,1),
(5,7,2),
(5,17,3),
(5,21,4),
(5,4,5),
(5,25,6),
(5,26,7),
(5,23,8),
(5,20,9),
(5,16,10),
(5,8,11),
(5,2,12),

-- Buss 4
(6,2,1),
(6,8,2),
(6,16,3),
(6,20,4),
(6,23,5),
(6,26,6),
(6,25,7),
(6,4,8),
(6,21,9),
(6,17,10),
(6,7,11),
(6,1,12),

-- Buss 5
(7,3,1),
(7,9,2),
(7,10,3),
(7,4,4),

-- Buss 6
(8,4,1),
(8,10,2),
(8,9,3),
(8,3,4),

-- Buss 7
(9,3,1),
(9,11,2),
(9,18,3),
(9,12,4),
(9,5,5),

-- Buss 8
(10,5,1),
(10,12,2),
(10,18,3),
(10,11,4),
(10,3,5),

-- Buss 9
(11,2,1),
(11,13,2),
(11,14,3),
(11,6,4),

-- Buss 10
(12,6,1),
(12,14,2),
(12,13,3),
(12,2,4)

